# Question 1

# Hypothesis Testing Exercise

### A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [1]:
import pandas as pd
import numpy as np
import scipy.stats as stats

 **Significance 5%**   
 **alpha = 0.05**

**Ho: mu_1 = mu_2**    
**H1: mu_1 != mu_2**

In [5]:
cutlet = pd.read_csv("Cutlets.csv")
cutlet.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [7]:
cutlet.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [12]:
p = stats.ttest_ind(cutlet['Unit A'],cutlet['Unit B'])[1]
print(p)

0.4722394724599501

In [13]:
if (p > 0.05):
    print("accept Ho mu of Unit A is equal to mu of Unit B")
else:
    print("reject H0  mu of Unit A is not equal to mu of Unit B")

accept Ho mu of Unit A is equal to mu of Unit B

In [15]:
#it is a two-tailed test
# alpha/2 = 0.025

alpha = 0.025
if p <= alpha:
    print('reject Null Hypothesis there is a significance difference between two Units A and B')
else:
    print('fail to reject Null hypothesis')

fail to reject Null hypothesis

# Question 2

# Hypothesis Testing Exercise

### A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
### Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [16]:
labtat = pd.read_csv("LabTAT.csv")
labtat.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [17]:
labtat.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [18]:
labtat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [27]:
lab0= labtat.iloc[:,0]; lab1= labtat.iloc[:,1]; lab2= labtat.iloc[:,2] ; lab3= labtat.iloc[:,3]
lab0,lab1,lab2,lab3

(0      185.35
 1      170.49
 2      192.77
 3      177.33
 4      193.41
         ...
 115    178.49
 116    176.08
 117    202.48
 118    182.40
 119    182.09
 Name: Laboratory 1, Length: 120, dtype: float64,
 0      165.53
 1      185.91
 2      194.92
 3      183.00
 4      169.57
         ...
 115    170.66
 116    183.98
 117    174.54
 118    197.18
 119    215.17
 Name: Laboratory 2, Length: 120, dtype: float64,
 0      176.70
 1      198.45
 2      201.23
 3      199.61
 4      204.63
         ...
 115    193.80
 116    215.25
 117    203.99
 118    194.52
 119    221.49
 Name: Laboratory 3, Length: 120, dtype: float64,
 0      166.13
 1      160.79
 2      185.18
 3      176.42
 4      152.60
         ...
 115    172.68
 116    177.64
 117    170.27
 118    150.87
 119    162.21
 Name: Laboratory 4, Length: 120, dtype: float64)

In [28]:
test_statistic , p = stats.f_oneway(lab0,lab1,lab2,lab3)
print(p)

2.1156708949992414e-57

In [29]:
alpha = 0.05
if p <= alpha:
    print('reject Null Hypothesis there is a significance difference between TAT of reports of the laboratories')
else:
    print('fail to reject Null hypothesis')

reject Null Hypothesis there is a significance difference between TAT of reports of the laboratories

# Question 3

# Hypothesis Testing Exercise

### Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [35]:
buyer = pd.read_csv("BuyerRatio.csv", index_col=0)
buyer

                 East  West  North  South
Observed Values
Males              50   142    131     70
Females           435  1523   1356    750

In [42]:
stat, p, dof, exp = stats.chi2_contingency(buyer) 
print("stat: ", stat,"\n","p: ", p,"\n", "dof: ", dof,"\n", "exp: ", exp)

stat:  1.595945538661058
 p:  0.6603094907091882
 dof:  3
 exp:  [[  42.76531299  146.81287862  131.11756787   72.30424052]
 [ 442.23468701 1518.18712138 1355.88243213  747.69575948]]

In [43]:
observed = np.array([50, 142, 131, 70, 435, 1523, 1356, 750])
expected = np.array([42.76531299,  146.81287862,  131.11756787, 72.30424052, 442.23468701, 1518.18712138, 1355.88243213, 747.69575948])

In [45]:
statistics, p = stats.chisquare(observed, expected, ddof = 3)
print("Statistics = ",statistics,"\n",'P = ', p)

Statistics =  1.5959455390914483
 P =  0.8095206646905712

In [46]:
alpha = 0.05
if p <= alpha:
    print('reject Null Hypothesis there is a significance difference between TAT of reports of the laboratories')
else:
    print('fail to reject Null hypothesis')

fail to reject Null hypothesis

# Question 4

# Hypothesis Testing Exercise

### TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain %  of the customer order forms. Any error in order form renders it defective and has to be reworked before processing.  The manager wants to check whether the defective %  varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

##### H0 : mu_1 = mu_2 = mu_3 = mu_4
##### H1 : Atleast One of them is Differente

In [49]:
center = pd.read_csv("CustomerOrderForm.csv")
center.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [50]:
center.describe()

       Phillippines   Indonesia       Malta       India
count           300         300         300         300
unique            2           2           2           2
top      Error Free  Error Free  Error Free  Error Free
freq            271         267         269         280

In [51]:
center.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [54]:
print(center['Phillippines'].value_counts(),'\n',center['Indonesia'].value_counts(),'\n',center['Malta'].value_counts(),'\n',center['India'].value_counts())

Phillippines
Error Free    271
Defective      29
Name: count, dtype: int64
 Indonesia
Error Free    267
Defective      33
Name: count, dtype: int64
 Malta
Error Free    269
Defective      31
Name: count, dtype: int64
 India
Error Free    280
Defective      20
Name: count, dtype: int64

In [55]:
conting_table = [[271,267,269,280],
                    [29,33,31,20]]

In [57]:
stat, p, df, exp = stats.chi2_contingency(conting_table)
print("Statistics = ",stat,"\n",'P = ', p,'\n', 'degree of freedom =', df,'\n', 'Expected Values = ', exp)

Statistics =  3.858960685820355
 P_Value =  0.2771020991233135
 degree of freedom = 3
 Expected Values =  [[271.75 271.75 271.75 271.75]
 [ 28.25  28.25  28.25  28.25]]

In [58]:
observed = np.array([271, 267, 269, 280, 29, 33, 31, 20])
expected = np.array([271.75, 271.75, 271.75, 271.75, 28.25, 28.25, 28.25, 28.25])

In [59]:
t_statistic , p = stats.chisquare(observed, expected, ddof = df)
print("Test Statistic = ",t_statistic,'\n', 'p =',p)

Test Statistic =  3.858960685820355
 p = 0.4254298144535761

In [61]:
alpha = 0.05
if p <= alpha:
    print('reject Null Hypothesis there is a significance difference between TAT of reports of the laboratories')
else:
    print('fail to reject Null hypothesis')

fail to reject Null hypothesis